# 1. Используем официальный образ Python в качестве базового.
# Выберите версию Python, которую вы используете (например, 3.9, 3.10, 3.11).
# slim-версии меньше по размеру.
FROM python:3.10-slim

# 2. Устанавливаем рабочую директорию внутри контейнера.
WORKDIR /app

# 3. Копируем файл с зависимостями в рабочую директорию.
COPY requirements.txt .

# 4. Устанавливаем зависимости.
# --no-cache-dir уменьшает размер образа, не сохраняя кэш pip.
# --trusted-host pypi.python.org - может понадобиться в некоторых сетях
RUN pip install --no-cache-dir -r requirements.txt

# 5. Копируем весь код вашего приложения в рабочую директорию.
# Если у вас только один файл main.py, можно указать COPY main.py .
COPY . .

# 6. Указываем порт, на котором будет работать ваше FastAPI приложение (Uvicorn).
# Это тот же порт, что будет использоваться в команде CMD.
EXPOSE 8000

# 7. Команда для запуска вашего FastAPI приложения при старте контейнера.
# Uvicorn будет слушать на 0.0.0.0, чтобы быть доступным извне контейнера.
# main:app - означает, что Uvicorn должен запустить объект 'app' из файла 'main.py'.
CMD ["uvicorn", "main:app", "--host", "0.0.0.0", "--port", "8000"]